<template><h1 id="设计模式-二-策略模式-待完善" tabindex="-1"><a class="header-anchor" href="#设计模式-二-策略模式-待完善" aria-hidden="true">#</a> 设计模式（二）策略模式（待完善）</h1>
<p>条条大陆通罗马</p>
<p>程序设计也参考了这个原理，在实现某一个功能时，也有多种方案可以选择</p>
<h2 id="一、什么是策略模式" tabindex="-1"><a class="header-anchor" href="#一、什么是策略模式" aria-hidden="true">#</a> 一、什么是策略模式</h2>
<h4 id="_1-1-概念" tabindex="-1"><a class="header-anchor" href="#_1-1-概念" aria-hidden="true">#</a> 1.1 概念</h4>
<p>定义：定义一系列的算法，把他们封装起来，并且可以使它们相互替换。</p>
<p>不变的部分和变化的部分隔开是每个设计模式的主题</p>
<p>策略模式也不例外，策略模式的目的就是将算法的使用与算法的实现分离开来。
在这个例子里，算法的使用方式是不变的，都是根据某个算法取得计算后的奖金数额。而算
法的实现是各异和变化的，每种绩效对应着不同的计算规则。
一个基于策略模式的程序至少由两部分组成。第一个部分是一组策略类，策略类封装了具体
的算法，并负责具体的计算过程。第二个部分是环境类 Context，Context 接受客户的请求，随后
把请求委托给某一个策略类。要做到这点，说明 Context 中要维持对某个策略对象的引用。
现在用策略模式来重构上面的代码。</p>
<h4 id="_1-2-例子" tabindex="-1"><a class="header-anchor" href="#_1-2-例子" aria-hidden="true">#</a> 1.2 例子</h4>
<h2 id="二、策略模式的优缺点" tabindex="-1"><a class="header-anchor" href="#二、策略模式的优缺点" aria-hidden="true">#</a> 二、策略模式的优缺点</h2>
<p><strong>优点：</strong></p>
<ol>
<li>策略模式利用组合、委托和多态等技术和思想，可以有效的避免多重条件选择语句</li>
<li>策略模式提供了对 开放-封闭 原则完美的支持，易于切换、易于理解、易于扩展</li>
<li>策略模式中的部分算法，也可以服用到其他地方</li>
</ol>
<p><strong>缺点：</strong></p>
<ol>
<li>策略模式会在程序中增加许多策略类，和策略对象</li>
<li>每一种策略都是要我们掌握的，也导致它们报漏在外</li>
</ol>
</template>
