<template><h1 id="设计模式-六-命令模式-待完善" tabindex="-1"><a class="header-anchor" href="#设计模式-六-命令模式-待完善" aria-hidden="true">#</a> 设计模式（六）命令模式（待完善）</h1>
<p>假设🈶️一个快餐店，而我是该餐厅的点餐服务员，我会接到无数的订单，而我会将订单列表交给厨师，让他按顺序做饭，这之前客人可以随时撤销订单。</p>
<p>这个订单列表 就是命令模式中的命令对象，即发布的命令都是从这个对象中来的</p>
<h2 id="用途" tabindex="-1"><a class="header-anchor" href="#用途" aria-hidden="true">#</a> 用途</h2>
<p>命令模式是最简单和优雅的模式之一，命令模式中的命令指的是一个执行某些特定事情的指令</p>
<p>拿订餐来说，客人需要向厨师发送请求，但是完全不知道这些厨师的名字和联系方式，也不
知道厨师炒菜的方式和步骤。命令模式把客人订餐的请求封装成 command 对象，也就是订餐中的
订单对象。这个对象可以在程序中被四处传递，就像订单可以从服务员手中传到厨师的手中。这
样一来，客人不需要知道厨师的名字，从而解开了请求调用者和请求接收者之间的耦合关系。</p>
<h2 id="命令模式的例子——菜单程序" tabindex="-1"><a class="header-anchor" href="#命令模式的例子——菜单程序" aria-hidden="true">#</a> 命令模式的例子——菜单程序</h2>
<p>设计模式的主题总是把不变的事物和变化的事物分离开来，命令模式也不例外。按下按钮之
后会发生一些事情是不变的，而具体会发生什么事情是可变的。通过 command 对象的帮助，将来
我们可以轻易地改变这种关联，因此也可以在将来再次改变按钮的行为。</p>
</template>
